package mac.projects.mac.projects6;

public class File6Task2 {
    public static void main(String[] args) {

        // Написать программу выводящую на экран только четные целые числа из диапазона от 1 до 100.

        for (int x = 2; x < 101; x += 2) {
            System.out.print(x + " ");
        }
    }
}
